"""
标准差:
    标准差是数值分散的测量。
    标准差即样本中各个个体与其平均数的差的平方的算术平均数的平方根，
    反映的是一个数据集的离散程度，值越大，越离散，即个体间差异越大。

    标准差的符号是 σ （希腊语字母 西格马，英语 sigma）
    公式很简单：方差的平方根。那么…… "方差是什么？"

方差:
    方差的定义是：
    离平均的平方距离的平均。
    按照以下的步骤来计算方差：
        求数值的 平均
        从每一个数值减去平均，然后求差的平方。
        求结果的平均。（为什么要求平方？)

    https://www.shuxuele.com/data/standard-deviation-formulas.html
    https://zhuanlan.zhihu.com/p/172506729

标椎误差：
    标准误差简单理解即是对平均数求标准差，
    比如一次实验会得到一个平均数，多次实验得到多个平均数，
    标准误差即是对这些平均数求标准差。
    其实际意义即是用来表示样本均值与总体均值的离散程度，
    标准误越小，样本均值和总体均值差距则越小，反之越大。
    标准误差用于预测样本数据准确性 ，标准误差越小，

    样本均值和总体均值差距越小，样本数据越能代表总体数据。
    由于我们不可能做很多次实验，
    所以标准误差通常由 样本的标准差除以样本容量的开平方来估算的。
"""

"""
标准正态分布（英语：standard normal distribution），
期望值μ=0，即曲线图象对称轴为Y轴，标准差σ=1条件下的正态分布，记为N(0，1)。
"""